package com.example.testalarm;

import android.os.Bundle;
import android.widget.ArrayAdapter;
import android.widget.ListView;

import androidx.appcompat.app.AppCompatActivity;

public class About11 extends AppCompatActivity {

    String array []={"نمط الحياة والعلاجات المنزلية\n" +
            "قم بالخطوات التالية لتحسين صحة قلبك:\n",
    "تجنَّب التدخين\n" +
            " أهم شيء يمكنك فعله لتحسين صحة قلبك هو عدم التدخين. كما يجب عليك تجنُّب التدخين السلبي. إذا كنت بحاجة للتوقف عن التدخين، فاستشر الطبيب للحصول على المساعدة.\n",
            "تحكم في مستويات ضغط الدم والكوليسترول لديك\n" +
                    " في حالة ارتفاع أحدهما أو كليهما، يمكن لطبيبك وصف تغييرات في نظاميك الغذائي والدوائي. اسأل طبيبك عن عدد مرات قياس ضغط الدم ومستويات الكوليسترول التي تحتاجها.\n",
            "أجرِ الفحوصات الطبية بانتظام\n" +
                    "لا تسبب بعض أكبر عوامل خطر الإصابة بالأزمات القلبية - ارتفاع مستوى كوليستيرول الدم وارتفاع ضغط الدم والسكري - أي أعراض في بداية الإصابة بها. يمكن لطبيبك إجراء اختبارات للكشف عن تلك الأمراض ويمكنه مساعدتك في التعامُل معها عند الحاجة.\n",
            "ممارسة التمارين الرياضية\n" +
                    " يمكن لممارسة الرياضية بانتظام أن تساعد في تحسين وظيفة عضلة القلب بعد الأزمة القلبية كما أنها تمنع الأزمات القلبية. يمكن للمشي لمدة 30 دقيقة، خمسة أيام في الأسبوع أن يحسِّن صحَّتك.\n",
            "حافِظْ على وزن صحي\n" +
                    " يضغط الوزن الزائد على قلبك ويساهم في ارتفاع مستوى الكوليستيرول وارتفاع ضغط الدم والإصابة بالسكري.\n",
            "تناول نظام غذائي مفيد لصحة القلب\n" +
                    " يمكن للدهون المشبَّعة والدهون المتحولة والكوليسترول الموجودة في نظامك الغذائي أن تضيق شرايين قلبك، كما يمكن لتناوُل كمية كبيرة من الملح أن ترفع ضغط الدم. تناوَلْ طعامًا صحيًّا للقلب يتضمن البروتين الخالي من الشحوم، كالأسماك والبقوليات، والفواكه والخضراوات والحبوب الكاملة.\n",
            "التعامل مع مرض السكري\n" +
                    " ممارسة الرياضية بانتظام وتناول الطعام الجيد وخسارة الوزن للحفاظ على مستويات سكر الدم في مستوًى مقبول. كما يحتاج الكثير من الناس لتناول الأدوية التي تساعدهم على التعامل مع إصابتهم بالسكري.\n",
            "تحكَّم في التوتر\n" +
                    " تخلص من الإجهاد في أنشطتك اليومية. أعِد التفكير في عاداتك الإدمانية وابحث عن الطرق الصحية لتقليل الأحداث المسبِّبة للتوتر في حياتك أو التعامل معها.\n",
            "إذا كنت تشرب الكحوليات، فاشربها باعتدال\n" +
                    " يعني هذا ما يصل إلى مشروب واحد في اليوم بالنسبة للنساء والرجال الأكبر سنًّا من 65 عامًا، وتصل إلى مشروبين في اليوم للرجال الذين تتراوح أعمارهم بين 65 عامًا أو أقل.\n",


    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_about11);

        ListView tiplist = (ListView)findViewById(R.id.list11);
        ArrayAdapter<String> arrayAdapter = new ArrayAdapter<String>(this, R.layout.activity_listview_tips,
                R.id.textView, array);


        tiplist.setAdapter(arrayAdapter);
    }
}
