package com.example.testalarm;

import android.os.Bundle;
import android.widget.ArrayAdapter;
import android.widget.ListView;

import androidx.appcompat.app.AppCompatActivity;

public class About6 extends AppCompatActivity {

    String array [] = {"عوامل الخطر\n" +
            "تساهم بعض العوامل في تراكم الرواسب الدهنية (تصلب الشرايين) بشكل غير مرغوب فيه، وهو ما يعمل على تضييق الشرايين في جميع أنحاء جسمك. يمكنك تحسين العديد من عوامل الخطر تلك أو القضاء عليها لتقليل فرص إصابتك بأولى نوباتك القلبية أو بنوبة قلبية أخرى.\n" +
            "تتضمن عوامل خطورة التعرض لنوبة قلبية ما يلي:\n",
    "•\tالعمر\n" +
            " الرجال الذين يبلغون من العمر 45 عامًا أو أكبر والنساء اللائي تتراوح أعمارهن بين 55 عامًا أو أكبر هم أكثر عرضة للإصابة بنوبة قلبية من الرجال والنساء الأصغر سنًّا.\n",
            "•\tالتبغ\n" +
                    " وهذا يتضمن التدخين والتعرض للتدخين السلبي على مدار فترة طويلة.\n",
            "•\tارتفاع ضغط الدم\n" +
                    " بمرور الوقت، من الممكن أن يتسبب ارتفاع في تلف الشرايين التي تغذي قلبك. كما أن ارتفاع ضغط الدم المصاحب للحالات الأخرى، مثل السمنة وارتفاع نسبة الكوليستيرول أو مرض السكري يزيد من هذه الخطورة بشكل أكبر.\n",
            "•\tارتفاع مستويات الكوليستيرول في الدم أو مستويات الدهون الثلاثية\n" +
                    "ومن المحتمل إلى حد بعيد أن يؤدي ارتفاع مستوى الكوليستيرول منخفض الكثافة (أو الكوليستيرول السيئ) إلى ضيق الشرايين. كما أن ارتفاع مستوى الدهون الثلاثية، وهي نوع من الدهون بالدم تتعلق بنظامك الغذائي، يمكن أن يزيد من خطورة تعرضك للنوبات القلبية. على الجانب الآخر، يقلل المستوى العالي من الكوليستيرول مرتفع الكثافة (الكوليستيرول الجيد) من خطورة تعرضك للنوبات القلبية.\n",
            "•\tالسِّمنة\n" +
                    " ترتبط السمنة بارتفاع مستويات الكوليستيرول في الدم وارتفاع مستويات الدهون الثلاثية وارتفاع ضغط الدم ومرض السكري. ومجرد إنقاص 10 في المائة من وزن جسمك يمكن أن يقلل من هذه الخطورة.\n",
            "•\tداء السُّكَّري\n" +
                    " كما أن عدم إنتاج القدر الكافي من أحد الهرمونات التي يفرزها بنكرياسك (وهو الأنسولين) أو عدم الاستجابة للأنسولين بشكل صحيح يؤدي إلى ارتفاع مستويات السكر في الدم في جسمك، وهذا ما يزيد من خطورة إصابتك بنوبة قلبية.\n",
            "•\tمُتلازمة الأيض (التمثيل الغذائي)\n" +
                    "وهذا ما يحدث عندما تكون مصابًا بالسمنة وارتفاع ضغط الدم وارتفاع سكر الدم. كما أن الإصابة بمتلازمة التمثيل الغذائي تضاعف من إصابتك بأمراض القلب بشكل يزيد عن عدم إصابتك بها.\n",
            "•\tتاريخ عائلي للإصابة بمرض من أمراض القلب\n" +
                    " إذا كان أخواتك أو والداك أو أجدادك قد سبق وتعرضوا لنوبات قلبية مبكرة (في عمر 55 للأقارب الذكور وفي عمر 65 للأقارب الإناث)، فقد تكون هناك خطورة متزايدة لتعرضك لنفس النوبات.\n",
            "•\tنقص النشاط البدني\n" +
                    "إن عدم النشاط يساهم في ارتفاع مستويات الكوليستيرول في الدم والإصابة بالسمنة. فالذين يمارسون الرياضة بانتظام يتمتعون بلياقة أفضل للقلب والأوعية الدموية، وارتفاع أقل في ضغط الدم.\n",
            "•\tالضغط النفسي\n" +
                    " من الممكن أن تستجيب للضغوط المحيطة بك بشكل يزيد من خطورة إصابتك بنوبة قلبية.\n",
            "•\tتعاطي المخدّرات\n" +
                    " إن تعاطي العقاقير المنشطة، مثل الكوكايين والأمفيتامينات، يمكن أن ينتج عنه تشنج في شرايينك التاجية وهو ما يمكن أن يعرضك للإصابة بنوبة قلبية.\n",
            "•\tتاريخ الإصابة بالارتعاج (تسمم الحمل)\n" +
                    " ينجم عن هذه الحالة ارتفاع ضغط الدم أثناء فترة الحمل، كما أنها تزيد من خطورة الإصابة بأمراض القلب على مدار الحياة.\n",
            "•\tحالة المناعة الذاتية\n" +
                    "كما أن الإصابة بحالة مثل التهاب المفاصل الروماتويدي أو الذئبة يمكن أن يزيد من خطورة التعرض لنوبة قلبية.\n",


    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_about6);

        ListView tiplist = (ListView)findViewById(R.id.list6);
        ArrayAdapter<String> arrayAdapter = new ArrayAdapter<String>(this, R.layout.activity_listview_tips,
                R.id.textView, array);


        tiplist.setAdapter(arrayAdapter);
    }
}
