package com.example.testalarm;

import android.os.Bundle;
import android.widget.ArrayAdapter;
import android.widget.ListView;

import androidx.appcompat.app.AppCompatActivity;

public class About9 extends AppCompatActivity {

    String array [] ={"التشخيص\n" +
            "ومن الناحية المثالية، يجب على الطبيب فحصك خلال الفحوصات البدنية المنتظمة لمعرفةِ ما إذا كان هناك عواملُ خطرٍ يمكن أن تؤدي إلى حدوث أزمة قلبية.\n" +
            "إذا كنتَ في وضع طارئ من أعراض الأزمة القلبية، فسوف تُسأَل عن أعراضك، وسيُجرَى لك فحص لضغط الدم والنبض ودرجة الحرارة. وسيُوصَّل بك جهاز مراقبة القلب، وستخضع لاختباراتٍ لمعرفةِ ما إذا كنت مصابًا بأزمة قلبية.\n" +
            "تشمل الاختبارات التالي:\n",
    "مخطط رسم القلب\n" +
            " (Electrocardiogram)\n" +
            "يُسجِّل مخطط رسم القلب (ECG) هذا الاختبار الأول الذي يُجَرى لتشخيص الأزمات القلبية النشاطَ الكهربائي لقلبك من خلال أقطاب كهربائية متصلة بجلدك. وتُسجَّل النبضات في صورة موجات معروضة على الشاشة أو مطبوعة على ورق. نظرًا لأن عضلات القلب المُصَابة لا تُصدِر نبضات كهربائية على النحو الطبيعي، فقد يُظهِر مخطَّط كهربية القلب أن هناك أزمة قلبية قد حدثت، أو أنها تحدث بالفعل.\n",
    "اختبارات الدم\n" +
            " (blood tests) \n" +
            "تتسرب بعض بروتينات القلب ببطء إلى دمك بعد الإصابة بأزمة قلبية. سيأخذ أطباء غرفة الطوارئ عينات من دمك لاختبار وجود هذه الإنزيمات.\n",
            "اختبارات إضافية\n" +
                    "إذا أُصبت من قبل بنوبة قلبية أو أحدها قيد الحدوث، فسيتخذ الأطباء خطوات فورية لعلاج حالتك. قد تخضع أيضًا لهذه الاختبارات الإضافية.\n",
            "تصوير الصدر بالأشعة السينية\n" +
                    " (Chest X-rays)\n" +
                    " يتمكن طبيبك عند إجراء صورة الأشعة السينية للصدر من فحص حجم القلب والأوعية الدموية والبحث عن السائل في رئتيك.\n",
            "مخطَّط صدى القلب\n" +
                    " (Echocardiogram) \n" +
                    " خلال هذا الاختبار، تُوجَّه موجات الصوت إلى قلبك من جهاز يُشبه العصا (محوّل الطاقة) معلق على صدرك وترتد عن قلبك وتُعالج إلكترونيًّا لإصدار صور فيديو لقلبك. يمكن أن يساعد مخطط \n" +
                    "صدى القلب في تحديد ما إذا كانت منطقة من قلبك قد تضررت ولا تضخ الدم بشكل طبيعي\n",
            "قسطرة الشريان التاجي\n" +
                    " (Coronary catheterization)   \n" +
                    "تُحقن شرايين القلب بصبغة سائلة عبر أنبوب طويل ورفيع (قِسطار) يمر عبر أحد الشرايين، عادةً في ساقك أو الأريبة، وصولًا إلى شرايين القلب. تجعل الصبغة الشرايين مرئية على صورة الأشعة السينية، وتكشف عن مناطق الانسداد.\n",
            "اختبار الإجهاد أثناء ممارسة التمارين \n" +
                    "في الأيام أو الأسابيع التالية للنوبة القلبية، قد تخضع أيضًا لاختبار الإجهاد لقياس كيفية استجابة القلب والأوعية الدموية للمجهود. ربما يُطلب منك السير على جهاز المشي أو التبديل على دراجة ثابتة بينما تكون مُوصَّلًا بجهاز تخطيط كهربية القلب. أو قد تُحقن بعقار عبر الوريد لتحفيز القلب بأسلوب يشبه التمارين الرياضية.\n" +
                    "قد يطلب منك أيضًا إجراء اختبار الإجهاد النووي، الذي يشبه اختبار الإجهاد أثناء ممارسة التمارين، ولكنه يستخدم صبغة تُحقن في الجسم وتقنيات تصوير خاصة لإنتاج صور مفصلة لقلبك أثناء ممارسة الرياضة.\n",
            "فحص التصوير المقطعي المحوسب  (CT) \n" +
                    "أو التصوير بالرنين المغناطيسي للقلب (MRI)\n" +
                    "الاختبارات لتشخيص مشاكل القلب، بما في ذلك مدى الضرر الناجم عن النوبات القلبية. في أثناء الفحص بالتصوير المقطعي المحوسب للقلب، تتمدد على طاولة داخل آلة على شكل كعكة دونات. يدور أنبوب الأشعة السينية الموجود داخل الآلة حول جسمك لالتقاط صور للقلب والصدر\n" +
                    "في التصوير بالرنين المغناطيسي للقلب، تتمدد على طاولة داخل آلة -علي شكل أنبوب- تنتج مجالًا مغناطيسيًّا. يحاذي الحقل المغناطيسي الجزيئات الذرية في بعض خلايا جسمك. عند بث موجات الراديو باتجاه هذه الجسيمات المُصْطَفّة، فإنها تنتج إشارات تختلف باختلاف نوع النسيج الذي هي عليه. تصدر الإشارات صورًا لقلبك.\n",


    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_about9);

        ListView tiplist = (ListView)findViewById(R.id.list9);
        ArrayAdapter<String> arrayAdapter = new ArrayAdapter<String>(this, R.layout.activity_listview_tips,
                R.id.textView, array);


        tiplist.setAdapter(arrayAdapter);
    }
}
